// worksheet1.lgt 
{
// 1  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 1 
            Авторизація виконана успішно;

}
// 2  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 2 
            Користувач не має доступу до цієї системи;

}
// 3  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 3 
            Користувача з таким ім'ям не існує;

}
// 4  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 4 
            Користувача з таким ім'ям не існує;

}
// 5  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 5 
            Авторизація виконана успішно;

}
// 6  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 6 
            Користувач не має доступу до цієї системи;

}
// 7  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 7 
            Користувача з таким ім'ям не існує;

}
// 8  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 8 
            Користувач не має доступу до цієї системи;
            Невірний пароль або логін;

}
// 9  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 9 
            Авторизація виконана успішно;

}
// 10  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 10 
            Користувач не має доступу до цієї системи;

}
// 11  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 11 
            Користувача з таким ім'ям не існує;

}
// 12  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 12 
            Користувача з таким ім'ям не існує;

}
// 13  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 13 
            Невірний пароль або логін;

}
// 14  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 14 
            Користувача з таким ім'ям не існує;
            Користувач не має доступу до цієї системи;

}
// 15  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 15 
            Невірний пароль або логін;

}
// 16  
if ( ((Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 16 
            Користувача з таким ім'ям не існує;
            Невірний пароль або логін;

}
// 17  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 17 
            Обов'язкові поля не заповнені;

}
// 18  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 18 
            Обов'язкові поля не заповнені;

}
// 19  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 19 
            Обов'язкові поля не заповнені;

}
// 20  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 20 
            Обов'язкові поля не заповнені;

}
// 21  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 21 
            Обов'язкові поля не заповнені;

}
// 22  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 22 
            Обов'язкові поля не заповнені;

}
// 23  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 23 
            Обов'язкові поля не заповнені;

}
// 24  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 24 
            Обов'язкові поля не заповнені;

}
// 25  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 25 
            Обов'язкові поля не заповнені;

}
// 26  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 26 
            Обов'язкові поля не заповнені;

}
// 27  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 27 
            Обов'язкові поля не заповнені;

}
// 28  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 28 
            Обов'язкові поля не заповнені;

}
// 29  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 29 
            Обов'язкові поля не заповнені;

}
// 30  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 30 
            Обов'язкові поля не заповнені;

}
// 31  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 31 
            Обов'язкові поля не заповнені;

}
// 32  
if ( ((Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 32 
            Обов'язкові поля не заповнені;

}
// 33  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 33 
            Обов'язкові поля не заповнені;

}
// 34  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 34 
            Обов'язкові поля не заповнені;

}
// 35  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 35 
            Обов'язкові поля не заповнені;

}
// 36  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 36 
            Обов'язкові поля не заповнені;

}
// 37  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 37 
            Обов'язкові поля не заповнені;

}
// 38  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 38 
            Обов'язкові поля не заповнені;

}
// 39  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 39 
            Обов'язкові поля не заповнені;

}
// 40  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 40 
            Обов'язкові поля не заповнені;

}
// 41  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 41 
            Обов'язкові поля не заповнені;

}
// 42  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 42 
            Обов'язкові поля не заповнені;

}
// 43  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 43 
            Обов'язкові поля не заповнені;

}
// 44  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 44 
            Обов'язкові поля не заповнені;

}
// 45  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 45 
            Обов'язкові поля не заповнені;

}
// 46  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 46 
            Обов'язкові поля не заповнені;

}
// 47  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 47 
            Обов'язкові поля не заповнені;

}
// 48  
if ( (!(Поле логін заповнене?)) && 
    ((Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 48 
            Обов'язкові поля не заповнені;

}
// 49  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 49 
            Обов'язкові поля не заповнені;

}
// 50  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 50 
            Обов'язкові поля не заповнені;

}
// 51  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 51 
            Обов'язкові поля не заповнені;

}
// 52  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 52 
            Обов'язкові поля не заповнені;

}
// 53  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 53 
            Обов'язкові поля не заповнені;

}
// 54  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 54 
            Обов'язкові поля не заповнені;

}
// 55  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 55 
            Обов'язкові поля не заповнені;

}
// 56  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    ((Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 56 
            Обов'язкові поля не заповнені;

}
// 57  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 57 
            Обов'язкові поля не заповнені;

}
// 58  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 58 
            Обов'язкові поля не заповнені;

}
// 59  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 59 
            Обов'язкові поля не заповнені;

}
// 60  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    ((Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 60 
            Обов'язкові поля не заповнені;

}
// 61  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 61 
            Обов'язкові поля не заповнені;

}
// 62  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    ((Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 62 
            Обов'язкові поля не заповнені;

}
// 63  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    ((Користувач має доступ до цієї системи)) ) {
            // rule 63 
            Обов'язкові поля не заповнені;

}
// 64  
if ( (!(Поле логін заповнене?)) && 
    (!(Поле пароль заповнене?)) && 
    (!(Логін збігається із регистром бази даних)) && 
    (!(Пароль збігається із регистром бази даних)) && 
    (!(Користувач з таким логіном або паролем існує у системі)) 
&& 
    (!(Користувач має доступ до цієї системи)) ) {
            // rule 64 
            Обов'язкові поля не заповнені;

}
}
